## STEP 1: Î¨∏Ï†ú Ï†ïÏùò Î∞è Î™©Ìëú ÏÑ§Ï†ï

**Î™©Ìëú:**
- ÌÉÄÏù¥ÌÉÄÎãâÌò∏ ÏäπÍ∞ùÎç∞Ïù¥ÌÑ∞Î•º Í∏∞Î∞òÏúºÎ°ú ÏÉùÏ°¥Ïóê ÏòÅÌñ•ÏùÑ ÎØ∏ÏπòÎäî ÏöîÏù∏ÏùÑ Î∂ÑÏÑùÌï©ÎãàÎã§.

**Ï£ºÏöî Í≥ºÏ†ú:**
- Í∏∞Î≥∏ EDA (Exploratory Data Analysis)
- Îç∞Ïù¥ÌÑ∞ Ï†ÑÏ≤òÎ¶¨ (Î∂àÌïÑÏöîÌïú Îç∞Ïù¥ÌÑ∞ ÏÇ≠Ï†ú, Ï∂îÍ∞Ä, Î≥ÄÍ≤Ω)
- Ïù∏ÏÇ¨Ïù¥Ìä∏ Î∞úÍµ¥

## STEP 2: Î™®Îìà import

In [105]:
import pandas as pd
import seaborn as sns

## STEP 3: Îç∞Ïù¥ÌÑ∞ÏÖã Î°úÎìú

In [106]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

'**Ïª¨Îüº(columns) ÏÑ§Î™Ö**

- survivied: ÏÉùÏ°¥Ïó¨Î∂Ä (1: ÏÉùÏ°¥, 0: ÏÇ¨Îßù)
- pclass: Ï¢åÏÑù Îì±Í∏â (1Îì±Í∏â, 2Îì±Í∏â, 3Îì±Í∏â)
- sex: ÏÑ±Î≥Ñ
- age: ÎÇòÏù¥
- sibsp: ÌòïÏ†ú + Î∞∞Ïö∞Ïûê Ïàò
- parch: Î∂ÄÎ™® + ÏûêÎÖÄ Ïàò
- fare: Ï¢åÏÑù ÏöîÍ∏à
- embarked: ÌÉëÏäπ Ìï≠Íµ¨ (S, C, Q)
- class: pclassÏôÄ ÎèôÏùº
- who: ÏÑ±Î≥ÑÍ≥º ÎèôÏùº
- adult_male: ÏÑ±Ïù∏ ÎÇ®Ïûê Ïó¨Î∂Ä
- deck: Îç∞ÌÅ¨ Î≤àÌò∏ (ÏïåÌååÎ≤≥ + Ïà´Ïûê ÌòºÏö©)
- embark_town: ÌÉëÏäπ Ìï≠Íµ¨ Ïù¥Î¶Ñ
- alive: ÏÉùÏ°¥Ïó¨Î∂Ä (yes, no)
- alone: ÌòºÏûê ÌÉëÏäπ Ïó¨Î∂Ä

## STEP 4: Í∏∞Î≥∏ Îç∞Ïù¥ÌÑ∞ Ï°∞Ìöå

### ÏÉÅÏúÑ 5Í∞úÏùò ÌñâÏùÑ Ï∂úÎ†•

In [107]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>survived</th>
      <th>pclass</th>
      <th>sex</th>
      <th>age</th>
      <th>sibsp</th>
      <th>parch</th>
      <th>fare</th>
      <th>embarked</th>
      <th>class</th>
      <th>who</th>
      <th>adult_male</th>
      <th>deck</th>
      <th>embark_town</th>
      <th>alive</th>
      <th>alone</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>7.2500</td>
      <td>S</td>
      <td>Third</td>
      <td>man</td>
      <td>True</td>
      <td>NaN</td>
      <td>Southampton</td>
      <td>no</td>
      <td>False</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>71.2833</td>
      <td>C</td>
      <td>First</td>
      <td>woman</td>
      <td>False</td>
      <td>C</td>
      <td>Cherbourg</td>
      <td>yes</td>
      <td>False</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>3</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>7.9250</td>
      <td>S</td>
      <td>Third</td>
      <td>woman</td>
      <td>False</td>
      <td>NaN</td>
      <td>Southampton</td>
      <td>yes</td>
      <td>True</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>53.1000</td>
      <td>S</td>
      <td>First</td>
      <td>woman</td>
      <td>False</td>
      <td>C</td>
      <td>Southampton</td>
      <td>yes</td>
      <td>False</td>
    </tr>
    <tr>
      <th>4</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>8.0500</td>
      <td>S</td>
      <td>Third</td>
      <td>man</td>
      <td>True</td>
      <td>NaN</td>
      <td>Southampton</td>
      <td>no</td>
      <td>True</td>
    </tr>
  </tbody>
</table>
</div>

### ÌïòÏúÑ 5Í∞úÏùò ÌñâÏùÑ Ï∂úÎ†•

In [108]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.tail(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>survived</th>
      <th>pclass</th>
      <th>sex</th>
      <th>age</th>
      <th>sibsp</th>
      <th>parch</th>
      <th>fare</th>
      <th>embarked</th>
      <th>class</th>
      <th>who</th>
      <th>adult_male</th>
      <th>deck</th>
      <th>embark_town</th>
      <th>alive</th>
      <th>alone</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>886</th>
      <td>0</td>
      <td>2</td>
      <td>male</td>
      <td>27.0</td>
      <td>0</td>
      <td>0</td>
      <td>13.00</td>
      <td>S</td>
      <td>Second</td>
      <td>man</td>
      <td>True</td>
      <td>NaN</td>
      <td>Southampton</td>
      <td>no</td>
      <td>True</td>
    </tr>
    <tr>
      <th>887</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>19.0</td>
      <td>0</td>
      <td>0</td>
      <td>30.00</td>
      <td>S</td>
      <td>First</td>
      <td>woman</td>
      <td>False</td>
      <td>B</td>
      <td>Southampton</td>
      <td>yes</td>
      <td>True</td>
    </tr>
    <tr>
      <th>888</th>
      <td>0</td>
      <td>3</td>
      <td>female</td>
      <td>NaN</td>
      <td>1</td>
      <td>2</td>
      <td>23.45</td>
      <td>S</td>
      <td>Third</td>
      <td>woman</td>
      <td>False</td>
      <td>NaN</td>
      <td>Southampton</td>
      <td>no</td>
      <td>False</td>
    </tr>
    <tr>
      <th>889</th>
      <td>1</td>
      <td>1</td>
      <td>male</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>30.00</td>
      <td>C</td>
      <td>First</td>
      <td>man</td>
      <td>True</td>
      <td>C</td>
      <td>Cherbourg</td>
      <td>yes</td>
      <td>True</td>
    </tr>
    <tr>
      <th>890</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>32.0</td>
      <td>0</td>
      <td>0</td>
      <td>7.75</td>
      <td>Q</td>
      <td>Third</td>
      <td>man</td>
      <td>True</td>
      <td>NaN</td>
      <td>Queenstown</td>
      <td>no</td>
      <td>True</td>
    </tr>
  </tbody>
</table>
</div>

### Îç∞Ïù¥ÌÑ∞Îäî Î™áÍ∞úÏùò ÌñâÍ≥º Ïó¥Î°ú Ïù¥Î£®Ïñ¥Ï†∏ ÏûàÎäîÏßÄ ÌôïÏù∏

In [110]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.shape

(891, 15)

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>(891, 15)</pre>

### Ïª¨Îüº Î≥Ñ Îç∞Ïù¥ÌÑ∞Ïùò dtypeÍ≥º Í∞úÏàòÎ•º ÌôïÏù∏

In [111]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre><class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype   
---  ------       --------------  -----   
 0   survived     891 non-null    int64   
 1   pclass       891 non-null    int64   
 2   sex          891 non-null    object  
 3   age          714 non-null    float64 
 4   sibsp        891 non-null    int64   
 5   parch        891 non-null    int64   
 6   fare         891 non-null    float64 
 7   embarked     889 non-null    object  
 8   class        891 non-null    category
 9   who          891 non-null    object  
 10  adult_male   891 non-null    bool    
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object  
 13  alive        891 non-null    object  
 14  alone        891 non-null    bool    
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
</pre>

### Îç∞Ïù¥ÌÑ∞Ïùò Ïª¨ÎüºÎ≥Ñ Í≤∞Ï∏°ÏπòÎ•º ÌôïÏù∏

In [113]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64</pre>

### ÏÉùÏ°¥ÏûêÏôÄ ÏÇ¨ÎßùÏûêÏùò Î∂ÑÌè¨Î•º ÌôïÏù∏Ìï¥ Ï£ºÏÑ∏Ïöî

0: ÏÇ¨Îßù, 1: ÏÉùÏ°¥

In [119]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df['survived'].value_counts()

survived
0    549
1    342
Name: count, dtype: int64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>0    549
1    342
Name: survived, dtype: int64</pre>

## STEP 5: ÌÉêÏÉâÏ†Å Îç∞Ïù¥ÌÑ∞ Î∂ÑÏÑù (EDA)

### Ìï≠Íµ¨Î≥Ñ ÏÉùÏ°¥Ïûê

#### Ìï©Í≥Ñ

In [172]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df_copy = df.copy()
# cond = df_copy['survived'] ==1

# df_copy.loc[cond,'embarked'].value_counts()
# 2Ô∏è‚É£ .groupby(['embarked'])['survived'].sum() ÎèôÏûë Í≥ºÏ†ï
# Ïù¥Ï†ú Ïù¥Í±∏ groupby()Î°ú Î¨∂Í≥† sum()ÏùÑ ÌïòÎ©¥:

# embarked	survived Í∞íÎì§	sum() Í≤∞Í≥º
# S	         1, 0, 1         2  (1+0+1)
# C	          1, 0	         1 (1+0)
# Q	         0, 1, 0	     1 (0+1+0)
# Ï¶â, sum()ÏùÄ 1(ÏÉùÏ°¥Ïûê)Îßå ÎçîÌïòÍ∏∞ ÎïåÎ¨∏Ïóê ÏÉùÏ°¥Ïûê ÏàòÎßå Ï∂úÎ†•ÎêòÎäî Í±∞Ïïº!
# ÏÇ¨ÎßùÏûêÎäî 0Ïù¥ÎãàÍπå ÎçîÌï¥ÎèÑ ÏòÅÌñ•Ïù¥ ÏóÜÍ≥†, ÏûêÏó∞Ïä§ÎüΩÍ≤å ÏÉùÏ°¥Ïûê ÏàòÎßå ÎÇòÏò§Í≤å ÎêòÎäî Í±∞ÏßÄ! üòÉ
df_copy.groupby(['embarked'])['survived'].sum()

embarked
C     93
Q     30
S    217
Name: survived, dtype: int64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>embarked
C     93
Q     30
S    217
Name: survived, dtype: int64</pre>

#### ÏÉùÏ°¥Ïú®

In [173]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df_copy.groupby(['embarked'])['survived'].mean()

embarked
C    0.553571
Q    0.389610
S    0.336957
Name: survived, dtype: float64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>embarked
C    0.553571
Q    0.389610
S    0.336957
Name: survived, dtype: float64</pre>

#### Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

In [174]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['embarked'])['survived'].agg(['sum', 'mean'])

          sum      mean
embarked
C          93  0.553571
Q          30  0.389610
S         217  0.336957

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>embarked</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>C</th>
      <td>93</td>
      <td>0.553571</td>
    </tr>
    <tr>
      <th>Q</th>
      <td>30</td>
      <td>0.389610</td>
    </tr>
    <tr>
      <th>S</th>
      <td>217</td>
      <td>0.336957</td>
    </tr>
  </tbody>
</table>
</div>

### ÏÑ±Î≥Ñ Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

In [175]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['sex'])['survived'].agg(['sum', 'mean'])

        sum      mean
sex
female  233  0.742038
male    109  0.188908

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>sex</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>female</th>
      <td>233</td>
      <td>0.742038</td>
    </tr>
    <tr>
      <th>male</th>
      <td>109</td>
      <td>0.188908</td>
    </tr>
  </tbody>
</table>
</div>

### ÌòºÏûêÏù∏ ÏÇ¨ÎûåÍ≥º ÌòºÏûêÍ∞Ä ÏïÑÎãå Í≤ΩÏö∞ Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

In [176]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['alone'])['survived'].agg(['sum', 'mean'])

       sum      mean
alone
False  179  0.505650
True   163  0.303538

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>alone</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>False</th>
      <td>179</td>
      <td>0.505650</td>
    </tr>
    <tr>
      <th>True</th>
      <td>163</td>
      <td>0.303538</td>
    </tr>
  </tbody>
</table>
</div>

### Îì±Í∏â(pclass)Î≥Ñ ÏÉùÏ°¥Ïûê Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

In [177]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['pclass'])['survived'].agg(['sum', 'mean'])

        sum      mean
pclass
1       136  0.629630
2        87  0.472826
3       119  0.242363

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>pclass</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>1</th>
      <td>136</td>
      <td>0.629630</td>
    </tr>
    <tr>
      <th>2</th>
      <td>87</td>
      <td>0.472826</td>
    </tr>
    <tr>
      <th>3</th>
      <td>119</td>
      <td>0.242363</td>
    </tr>
  </tbody>
</table>
</div>

### ÏÑ±Î≥Ñ, Îì±Í∏âÎ≥Ñ ÏÉùÏ°¥Ïûê Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

In [179]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['sex', 'pclass'])['survived'].agg(['sum', 'mean'])

               sum      mean
sex    pclass
female 1        91  0.968085
       2        70  0.921053
       3        72  0.500000
male   1        45  0.368852
       2        17  0.157407
       3        47  0.135447

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>sex</th>
      <th>pclass</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">female</th>
      <th>1</th>
      <td>91</td>
      <td>0.968085</td>
    </tr>
    <tr>
      <th>2</th>
      <td>70</td>
      <td>0.921053</td>
    </tr>
    <tr>
      <th>3</th>
      <td>72</td>
      <td>0.500000</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">male</th>
      <th>1</th>
      <td>45</td>
      <td>0.368852</td>
    </tr>
    <tr>
      <th>2</th>
      <td>17</td>
      <td>0.157407</td>
    </tr>
    <tr>
      <th>3</th>
      <td>47</td>
      <td>0.135447</td>
    </tr>
  </tbody>
</table>
</div>

### ÏÑ±Î≥Ñ, pclass Î≥Ñ ÏÉùÏ°¥Ïûê Ìï©Í≥Ñ(sum)Î•º Ï∂úÎ†• ÌïòÏÑ∏Ïöî

- `pivot_table()`Î•º ÏÇ¨Ïö©Ìï©ÎãàÎã§.

In [181]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.pivot_table(index = 'sex', columns='pclass', values='survived', aggfunc=['sum', 'mean'])

       sum              mean
pclass   1   2   3         1         2         3
sex
female  91  70  72  0.968085  0.921053  0.500000
male    45  17  47  0.368852  0.157407  0.135447

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead tr th {
        text-align: left;
    }

    .dataframe thead tr:last-of-type th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr>
      <th></th>
      <th colspan="3" halign="left">sum</th>
      <th colspan="3" halign="left">mean</th>
    </tr>
    <tr>
      <th>pclass</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
      <th>1</th>
      <th>2</th>
      <th>3</th>
    </tr>
    <tr>
      <th>sex</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>female</th>
      <td>91</td>
      <td>70</td>
      <td>72</td>
      <td>0.968085</td>
      <td>0.921053</td>
      <td>0.500000</td>
    </tr>
    <tr>
      <th>male</th>
      <td>45</td>
      <td>17</td>
      <td>47</td>
      <td>0.368852</td>
      <td>0.157407</td>
      <td>0.135447</td>
    </tr>
  </tbody>
</table>
</div>

### ÌòºÏûêÏù∏ Í≤ΩÏö∞ / ÏÑ±Î≥Ñ Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

- `groupby()` Î•º ÏÇ¨Ïö©Ìï©ÎãàÎã§.

In [185]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['alone', 'sex'])[['survived']].agg(['sum', 'mean'])

             survived
                  sum      mean
alone sex
False female      134  0.712766
      male         45  0.271084
True  female       99  0.785714
      male         64  0.155718

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>alone</th>
      <th>sex</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="2" valign="top">False</th>
      <th>female</th>
      <td>134</td>
      <td>0.712766</td>
    </tr>
    <tr>
      <th>male</th>
      <td>45</td>
      <td>0.271084</td>
    </tr>
    <tr>
      <th rowspan="2" valign="top">True</th>
      <th>female</th>
      <td>99</td>
      <td>0.785714</td>
    </tr>
    <tr>
      <th>male</th>
      <td>64</td>
      <td>0.155718</td>
    </tr>
  </tbody>
</table>
</div>

### who, Îì±Í∏âÎ≥Ñ ÏÉùÏ°¥Ïûê Ìï©Í≥Ñ & ÏÉùÏ°¥Ïú® ÎèôÏãú Ï∂úÎ†•

- `groupby()` Î•º ÏÇ¨Ïö©Ìï©ÎãàÎã§.

In [186]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

df.groupby(['who', 'pclass'])['survived'].agg(['sum', 'mean'])

              sum      mean
who   pclass
child 1         5  0.833333
      2        19  1.000000
      3        25  0.431034
man   1        42  0.352941
      2         8  0.080808
      3        38  0.119122
woman 1        89  0.978022
      2        60  0.909091
      3        56  0.491228

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>sum</th>
      <th>mean</th>
    </tr>
    <tr>
      <th>who</th>
      <th>pclass</th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">child</th>
      <th>1</th>
      <td>5</td>
      <td>0.833333</td>
    </tr>
    <tr>
      <th>2</th>
      <td>19</td>
      <td>1.000000</td>
    </tr>
    <tr>
      <th>3</th>
      <td>25</td>
      <td>0.431034</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">man</th>
      <th>1</th>
      <td>42</td>
      <td>0.352941</td>
    </tr>
    <tr>
      <th>2</th>
      <td>8</td>
      <td>0.080808</td>
    </tr>
    <tr>
      <th>3</th>
      <td>38</td>
      <td>0.119122</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">woman</th>
      <th>1</th>
      <td>89</td>
      <td>0.978022</td>
    </tr>
    <tr>
      <th>2</th>
      <td>60</td>
      <td>0.909091</td>
    </tr>
    <tr>
      <th>3</th>
      <td>56</td>
      <td>0.491228</td>
    </tr>
  </tbody>
</table>
</div>

### Îã§ÏùåÏùÑ ÏàòÌñâÌïòÏÑ∏Ïöî

ÏúÑÏùò Í≤∞Í≥ºÎ•º ÌÜ†ÎåÄÎ°ú
1. Î≥ÑÎèÑÏùò DataFrameÎ°ú ÏÉùÏÑ± 
2. Ïù∏Îç±Ïä§ Ï¥àÍ∏∞Ìôî `reset_index()` 
3. ÏÉùÏ°¥Ïú® ÎÇ¥Î¶ºÏ∞®Ïàú Ï†ïÎ†¨

In [193]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df1 = df.groupby(['who', 'pclass'])['survived'].agg(['sum', 'mean'])
df2 = pd.DataFrame(df1).reset_index()
df2.sort_values('mean', ascending = False)

     who  pclass  sum      mean
1  child       2   19  1.000000
6  woman       1   89  0.978022
7  woman       2   60  0.909091
0  child       1    5  0.833333
8  woman       3   56  0.491228
2  child       3   25  0.431034
3    man       1   42  0.352941
5    man       3   38  0.119122
4    man       2    8  0.080808

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>who</th>
      <th>pclass</th>
      <th>sum</th>
      <th>mean</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>child</td>
      <td>2</td>
      <td>19</td>
      <td>1.000000</td>
    </tr>
    <tr>
      <th>1</th>
      <td>woman</td>
      <td>1</td>
      <td>89</td>
      <td>0.978022</td>
    </tr>
    <tr>
      <th>2</th>
      <td>woman</td>
      <td>2</td>
      <td>60</td>
      <td>0.909091</td>
    </tr>
    <tr>
      <th>3</th>
      <td>child</td>
      <td>1</td>
      <td>5</td>
      <td>0.833333</td>
    </tr>
    <tr>
      <th>4</th>
      <td>woman</td>
      <td>3</td>
      <td>56</td>
      <td>0.491228</td>
    </tr>
    <tr>
      <th>5</th>
      <td>child</td>
      <td>3</td>
      <td>25</td>
      <td>0.431034</td>
    </tr>
    <tr>
      <th>6</th>
      <td>man</td>
      <td>1</td>
      <td>42</td>
      <td>0.352941</td>
    </tr>
    <tr>
      <th>7</th>
      <td>man</td>
      <td>3</td>
      <td>38</td>
      <td>0.119122</td>
    </tr>
    <tr>
      <th>8</th>
      <td>man</td>
      <td>2</td>
      <td>8</td>
      <td>0.080808</td>
    </tr>
  </tbody>
</table>
</div>

### childÏùò ÎÇòÏù¥Îäî Î™á ÏÑ∏Î∂ÄÌÑ∞ Î™á ÏÑ∏ÍπåÏßÄ Ï†ïÏùòÎêòÏóàÎäîÏßÄ ÌôïÏù∏

hint: `.loc`ÏôÄ `agg`Î•º ÌôúÏö©Ìï©ÎãàÎã§.

In [199]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
# cond = df['who'] == 'child'
# df.loc[cond]['age'].agg(['min', 'max'])

df.loc[df['who'] == 'child', 'age'].agg(['min', 'max'])

min     0.42
max    15.00
Name: age, dtype: float64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>min     0.42
max    15.00
Name: age, dtype: float64</pre>

### Îì±Í∏âÎ≥Ñ(pclass) / Ïó∞Î†πÎ≥Ñ(who) ÌèâÍ∑† ÏöîÍ∏à ÎπÑÍµê

In [201]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.groupby(['pclass', 'who'])[['fare']].mean()

                    fare
pclass who
1      child  139.382633
       man     65.951086
       woman  104.317995
2      child   28.323905
       man     19.054124
       woman   20.868624
3      child   23.220190
       man     11.340213
       woman   15.354351

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>fare</th>
    </tr>
    <tr>
      <th>pclass</th>
      <th>who</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="3" valign="top">1</th>
      <th>child</th>
      <td>139.382633</td>
    </tr>
    <tr>
      <th>man</th>
      <td>65.951086</td>
    </tr>
    <tr>
      <th>woman</th>
      <td>104.317995</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">2</th>
      <th>child</th>
      <td>28.323905</td>
    </tr>
    <tr>
      <th>man</th>
      <td>19.054124</td>
    </tr>
    <tr>
      <th>woman</th>
      <td>20.868624</td>
    </tr>
    <tr>
      <th rowspan="3" valign="top">3</th>
      <th>child</th>
      <td>23.220190</td>
    </tr>
    <tr>
      <th>man</th>
      <td>11.340213</td>
    </tr>
    <tr>
      <th>woman</th>
      <td>15.354351</td>
    </tr>
  </tbody>
</table>
</div>

### Î∂ÄÏûêÎäî ÏÇ¥ÏïòÏùÑÍπå?

- **Î∂ÄÏûê**Îäî `fare`ÏöîÍ∏àÏùÑ ÏÉÅÏúÑ 10% Ïù¥ÏÉÅ ÎÇ∏ ÏäπÍ∞ùÏúºÎ°ú Ï†ïÏùòÌï©ÎãàÎã§.

fare ÏöîÍ∏à Í∏∞Ï§Ä ÏÉÅÏúÑ 10% Í∏∞Ï§Ä ÏöîÍ∏à ÌôïÏù∏

In [204]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
print(df['fare'].quantile(0.9))

77.9583

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>77.9583</pre>

Î∂ÄÏûêÏùò Îç∞Ïù¥ÌÑ∞ Í∞úÏàòÏôÄ ÏÉùÏ°¥Ïú® ÌôïÏù∏

In [214]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
rich = df['fare'].quantile(0.9)
df.loc[df['fare'] >= rich , 'survived'].agg(['count', 'mean'])

count    90.000000
mean      0.766667
Name: survived, dtype: float64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>count    90.000000
mean      0.766667
Name: survived, dtype: float64</pre>

### ÏÉùÏ°¥ÏûêÏùò ÌèâÍ∑† ÎÇòÏù¥ÏôÄ ÏÇ¨ÎßùÏûêÏùò ÌèâÍ∑† ÎÇòÏù¥ ÎπÑÍµê

In [225]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
cond1 = df['survived'] == 0
cond2 = df['survived'] == 1
df.groupby(['survived'])['age'].mean()

survived
0    30.626179
1    28.343690
Name: age, dtype: float64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>survived
0    30.626179
1    28.343690
Name: age, dtype: float64</pre>

### deck Ï†ïÎ≥¥Í∞Ä NaNÏù∏ Í≤ΩÏö∞ÏôÄ Ï±ÑÏõåÏ†∏ ÏûàÎäî Í≤ΩÏö∞ ÏÉùÏ°¥Ïú® ÎπÑÍµê

deck Ï†ïÎ≥¥Í∞Ä Í≤∞Ï∏°ÏπòÏù∏ Í≤ΩÏö∞ ÏÉùÏ°¥Ïú®

In [234]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
cond = df['deck'].isnull()
print(df.loc[cond, 'survived'].mean())

0.29941860465116277

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>0.29941860465116277</pre>

deck Ï†ïÎ≥¥Í∞Ä Í≤∞Ï∏°ÏπòÍ∞Ä ÏïÑÎãå Í≤ΩÏö∞ ÏÉùÏ°¥Ïú®

In [237]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
cond = df['deck'].notnull()
print(df.loc[cond, 'survived'].mean())

0.6699507389162561

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>0.6699507389162561</pre>

## STEP 6: Ï†ÑÏ≤òÎ¶¨ (pre-processing)

### Í≤∞Ï∏°Ïπò Ï≤òÎ¶¨

a) Í≤∞Ï∏°Ïπò ÌôïÏù∏

In [238]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64</pre>

b) `embarked` Ïª¨ÎüºÏùò Í≤∞Ï∏°ÏπòÏóê ÎåÄÌïòÏó¨ **ÏµúÎπàÍ∞í(mode)**ÏúºÎ°ú Ï±ÑÏõå Ï£ºÏÑ∏Ïöî

In [245]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df['embarked'].mode()
df['embarked'] = df['embarked'].fillna('mode[0]')

In [246]:
# ÏΩîÎìúÍ≤ÄÏ¶ù
# Cell Ïã§ÌñâÏãú ÏóêÎü¨Í∞Ä ÎÇòÏßÄ ÏïäÏïÑÏïº Ìï®
assert 0 == df['embarked'].isnull().sum()

c) `age` Ïª¨ÎüºÏùò Í≤∞Ï∏°Ïπò Ï≤òÎ¶¨
- ÎÇ®ÏûêÎùºÎ©¥ => ÎÇ®Ïûê ÌèâÍ∑† ÎÇòÏù¥Î°ú Ï±ÑÏõÅÎãàÎã§.
- Ïó¨ÏûêÎùºÎ©¥ => Ïó¨Ïûê ÌèâÍ∑† ÎÇòÏù¥Î°ú Ï±ÑÏõÅÎãàÎã§.

In [248]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

KeyError: False

In [ ]:
# ÏΩîÎìúÍ≤ÄÏ¶ù
# Cell Ïã§ÌñâÏãú ÏóêÎü¨Í∞Ä ÎÇòÏßÄ ÏïäÏïÑÏïº Ìï®
assert df.groupby('sex')['age'].mean()['female'].round(4) == 27.9157
assert df.groupby('sex')['age'].mean()['male'].round(4) == 30.7266
assert df['age'].isnull().sum() == 0

d) `deck` Ïª¨Îüº Í≤∞Ï∏°ÏπòÎäî **No Data**Î°ú Ï±ÑÏõÅÎãàÎã§.

CategoricalDtype ÏûÑÏùÑ ÏóºÎëêÌï¥ Ï£ºÏÑ∏Ïöî

In [ ]:
df['deck'].dtype

`No Data`Î•º Ïπ¥ÌÖåÍ≥†Î¶¨Ïóê Î®ºÏ†Ä **Ï∂îÍ∞Ä**ÌïòÍ∏∞

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

`No Data`Î°ú Í≤∞Ï∏°Ïπò Ï±ÑÏö∞Í∏∞

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

In [ ]:
# Í≤ÄÏ¶ùÏΩîÎìú
df['deck'].value_counts()

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>No Data    688
C           59
B           47
D           33
E           32
A           15
F           13
G            4
Name: deck, dtype: int64</pre>

### Ï§ëÎ≥µÎêú Ïª¨Îüº Ï†úÍ±∞

Ï†úÍ±∞ ÎåÄÏÉÅ Ïª¨Îüº
- `class`, `embark_town`, `alive`

In [ ]:
df.head()

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>survived</th>
      <th>pclass</th>
      <th>sex</th>
      <th>age</th>
      <th>sibsp</th>
      <th>parch</th>
      <th>fare</th>
      <th>embarked</th>
      <th>who</th>
      <th>adult_male</th>
      <th>deck</th>
      <th>alone</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>7.2500</td>
      <td>S</td>
      <td>man</td>
      <td>True</td>
      <td>No Data</td>
      <td>False</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>71.2833</td>
      <td>C</td>
      <td>woman</td>
      <td>False</td>
      <td>C</td>
      <td>False</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>3</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>7.9250</td>
      <td>S</td>
      <td>woman</td>
      <td>False</td>
      <td>No Data</td>
      <td>True</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>53.1000</td>
      <td>S</td>
      <td>woman</td>
      <td>False</td>
      <td>C</td>
      <td>False</td>
    </tr>
    <tr>
      <th>4</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>8.0500</td>
      <td>S</td>
      <td>man</td>
      <td>True</td>
      <td>No Data</td>
      <td>True</td>
    </tr>
  </tbody>
</table>
</div>

### ÌäπÏÑ± Í≥µÌïô (feature engineering)

a) Í∞ÄÏ°±Ïùò Ïà´ÏûêÎäî `sibsp` + `parch` Ïà´Ïûê ÏûÖÎãàÎã§. `family` Ïª¨ÎüºÏùÑ ÎßåÎì§Í≥† **sibsp + parch ÎçîÌïú Í∞íÏùÑ ÏûÖÎ†•**Ìï¥ Ï£ºÏÑ∏Ïöî

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>survived</th>
      <th>pclass</th>
      <th>sex</th>
      <th>age</th>
      <th>sibsp</th>
      <th>parch</th>
      <th>fare</th>
      <th>embarked</th>
      <th>who</th>
      <th>adult_male</th>
      <th>deck</th>
      <th>alone</th>
      <th>family</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>22.0</td>
      <td>1</td>
      <td>0</td>
      <td>7.2500</td>
      <td>S</td>
      <td>man</td>
      <td>True</td>
      <td>No Data</td>
      <td>False</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>38.0</td>
      <td>1</td>
      <td>0</td>
      <td>71.2833</td>
      <td>C</td>
      <td>woman</td>
      <td>False</td>
      <td>C</td>
      <td>False</td>
      <td>1</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>3</td>
      <td>female</td>
      <td>26.0</td>
      <td>0</td>
      <td>0</td>
      <td>7.9250</td>
      <td>S</td>
      <td>woman</td>
      <td>False</td>
      <td>No Data</td>
      <td>True</td>
      <td>0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>1</td>
      <td>female</td>
      <td>35.0</td>
      <td>1</td>
      <td>0</td>
      <td>53.1000</td>
      <td>S</td>
      <td>woman</td>
      <td>False</td>
      <td>C</td>
      <td>False</td>
      <td>1</td>
    </tr>
    <tr>
      <th>4</th>
      <td>0</td>
      <td>3</td>
      <td>male</td>
      <td>35.0</td>
      <td>0</td>
      <td>0</td>
      <td>8.0500</td>
      <td>S</td>
      <td>man</td>
      <td>True</td>
      <td>No Data</td>
      <td>True</td>
      <td>0</td>
    </tr>
  </tbody>
</table>
</div>

Îã§ÏùåÏùÑ ÏàòÌñâÌïòÏÑ∏Ïöî

- ÏÑ±Î≥Ñ(sex), Í∞ÄÏ°±Ïàò(family)Î≥Ñ ÏÉùÏ°¥Ïú®ÏùÑ ÌôïÏù∏
- `reset_index()`ÌõÑ ÏÉùÏ°¥Ïú® ÎÇ¥Î¶ºÏ∞®Ïàú Ï†ïÎ†¨

b) ÏÑ±Î≥Ñ Í∞ÄÏ°±Ïàò Î≥Ñ ÏÉùÏ°¥Ïú® ÌôïÏù∏

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th></th>
      <th>survived</th>
    </tr>
    <tr>
      <th>sex</th>
      <th>family</th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th rowspan="9" valign="top">female</th>
      <th>0</th>
      <td>0.785714</td>
    </tr>
    <tr>
      <th>1</th>
      <td>0.816092</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.775510</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0.842105</td>
    </tr>
    <tr>
      <th>4</th>
      <td>0.250000</td>
    </tr>
    <tr>
      <th>5</th>
      <td>0.375000</td>
    </tr>
    <tr>
      <th>6</th>
      <td>0.375000</td>
    </tr>
    <tr>
      <th>7</th>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>10</th>
      <td>0.000000</td>
    </tr>
    <tr>
      <th rowspan="9" valign="top">male</th>
      <th>0</th>
      <td>0.155718</td>
    </tr>
    <tr>
      <th>1</th>
      <td>0.243243</td>
    </tr>
    <tr>
      <th>2</th>
      <td>0.396226</td>
    </tr>
    <tr>
      <th>3</th>
      <td>0.500000</td>
    </tr>
    <tr>
      <th>4</th>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>5</th>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>6</th>
      <td>0.250000</td>
    </tr>
    <tr>
      <th>7</th>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>10</th>
      <td>0.000000</td>
    </tr>
  </tbody>
</table>
</div>

c) ÏÉùÏ°¥Ïú® TOP 5 Ï∂úÎ†•

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sex</th>
      <th>family</th>
      <th>survived</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>female</td>
      <td>3</td>
      <td>0.842105</td>
    </tr>
    <tr>
      <th>1</th>
      <td>female</td>
      <td>1</td>
      <td>0.816092</td>
    </tr>
    <tr>
      <th>2</th>
      <td>female</td>
      <td>0</td>
      <td>0.785714</td>
    </tr>
    <tr>
      <th>3</th>
      <td>female</td>
      <td>2</td>
      <td>0.775510</td>
    </tr>
    <tr>
      <th>4</th>
      <td>male</td>
      <td>3</td>
      <td>0.500000</td>
    </tr>
  </tbody>
</table>
</div>

d) ÏÉùÏ°¥Ïú® ÌïòÏúÑ TOP 10 Ï∂úÎ†•

In [ ]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>sex</th>
      <th>family</th>
      <th>survived</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>female</td>
      <td>4</td>
      <td>0.250000</td>
    </tr>
    <tr>
      <th>1</th>
      <td>male</td>
      <td>6</td>
      <td>0.250000</td>
    </tr>
    <tr>
      <th>2</th>
      <td>male</td>
      <td>1</td>
      <td>0.243243</td>
    </tr>
    <tr>
      <th>3</th>
      <td>male</td>
      <td>0</td>
      <td>0.155718</td>
    </tr>
    <tr>
      <th>4</th>
      <td>female</td>
      <td>10</td>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>5</th>
      <td>male</td>
      <td>4</td>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>6</th>
      <td>male</td>
      <td>5</td>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>7</th>
      <td>female</td>
      <td>7</td>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>8</th>
      <td>male</td>
      <td>7</td>
      <td>0.000000</td>
    </tr>
    <tr>
      <th>9</th>
      <td>male</td>
      <td>10</td>
      <td>0.000000</td>
    </tr>
  </tbody>
</table>
</div>

e) ÏöîÍ∏àÏùÑ 5Íµ¨Í∞ÑÏúºÎ°ú ÎÇòÎàÑÏñ¥ `fare_bin` Ïª¨ÎüºÏùÑ ÏÉàÎ°ú ÎßåÎì§Ïñ¥ Ï†ÅÏö©ÌïòÏÑ∏Ïöî (ÎèôÏùºÌïú Î∂ÑÌè¨Î•º Í∞ñÎèÑÎ°ù `pd.qcut()`ÏùÑ ÏÇ¨Ïö©Ìï©ÎãàÎã§)

In [104]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
df['fare_bin'] = pd.qcut(df['fare'], q = 5)
df['fare_bin'].value_counts()

fare_bin
(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: count, dtype: int64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>(7.854, 10.5]        184
(21.679, 39.688]     180
(-0.001, 7.854]      179
(39.688, 512.329]    176
(10.5, 21.679]       172
Name: fare_bin, dtype: int64</pre>

f) ÎÇòÏù¥Î•º 10Íµ¨Í∞ÑÏúºÎ°ú ÎÇòÎàÑÏñ¥ Ï∂úÎ†•Ìï©ÎãàÎã§. (ÎèôÏùºÌïú Íµ¨Í∞ÑÏùÑ Í∞ñÎèÑÎ°ù `pd.cut()`ÏùÑ ÏÇ¨Ïö©Ìï©ÎãàÎã§.)

In [101]:
# ÏΩîÎìúÎ•º ÏûÖÎ†•Ìï¥ Ï£ºÏÑ∏Ïöî
pd.cut(df['age'], bins =10).value_counts()

age
(16.336, 24.294]    177
(24.294, 32.252]    169
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.34, 8.378]        54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: count, dtype: int64

<p><strong>[Ï∂úÎ†• Í≤∞Í≥º]</strong></p><pre>(24.294, 32.252]    346
(16.336, 24.294]    177
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.34, 8.378]        54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: age_bin, dtype: int64</pre>